Tekla Open API Reference for Tekla Structures 2025
View.ViewMarkTagAttributes Constructor (Vector, TagLocation, TextAlignment, ContainerElement)
 Creates a new mark tag attributes instance with the given offset, location, alignment and content.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ViewMarkTagAttributes(
	Vector offset,
	TagLocation location,
	TextAlignment alignment,
	ContainerElement tagContent
)
Public Sub New (
	offset As Vector,
	location As TagLocation,
	alignment As TextAlignment,
	tagContent As ContainerElement
)
Parameters
offset
Type: Tekla.Structures.Geometry3d.Vector
The offset of the mark tag to be used.
location
Type: Tekla.Structures.Drawing.TagLocation
The location of the mark tag to be used.
alignment
Type: Tekla.Structures.Drawing.TextAlignment
The alignment of the mark tag text to be used.
tagContent
Type: Tekla.Structures.Drawing.ContainerElement
The content of the mark tag to be used.
See Also
Reference
View.ViewMarkTagAttributes Class
View.ViewMarkTagAttributes Overload
Tekla.Structures.Drawing Namespace